Realizando a  analise de salarios de são São Francisco (USA)

In [38]:
import numpy as np

import pandas as pd
import os
from  pathlib import Path

# Importações

In [14]:
# Variáveis
DATASETS_ROOT_DIR = Path(os.path.abspath(os.curdir)).parent / 'datasets'

In [ ]:
# Funções

In [48]:
# Carregando o df

df = pd.read_csv(DATASETS_ROOT_DIR / 'Salarios_SF.csv')

C:\Users\root\AppData\Local\Temp\ipykernel_7344\1680589119.py:3: DtypeWarning: Columns (2,3,4,5) have mixed types. Specify dtype option on import or set low_memory=False.
  df = pd.read_csv(DATASETS_ROOT_DIR / 'Salarios_SF.csv')

In [49]:
# Uma olhada para saber a estrutura de colunas do dataset.
df.head()

,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year
0,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,Not Provided,567595.43,567595.43,2011
1,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,Not Provided,538909.28,538909.28,2011
2,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,Not Provided,335279.91,335279.91,2011
3,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,Not Provided,332343.61,332343.61,2011
4,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,Not Provided,326373.19,326373.19,2011

In [50]:
# Uma olhada na composição e para saber cada tipo de dados.
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 312882 entries, 0 to 312881
Data columns (total 9 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   EmployeeName      312882 non-null  object
 1   JobTitle          312882 non-null  object
 2   BasePay           312882 non-null  object
 3   OvertimePay       312882 non-null  object
 4   OtherPay          312882 non-null  object
 5   Benefits          312882 non-null  object
 6   TotalPay          312882 non-null  float64
 7   TotalPayBenefits  312882 non-null  float64
 8   Year              312882 non-null  int64
dtypes: float64(2), int64(1), object(6)
memory usage: 21.5+ MB

In [56]:
# as colunas acima que apresentaram seu dtype como object, foi porque temos valores textuais nestas colunas, por conta disso não estava funcionando a conversão
# realizei o replace dos valores para 0
df_1 = df.replace('Not Provided', value=0)
df_1[df == 'Not Provided']
# Eu sei, eu sei, usei o df ao invés do DF1 né, mas foi de propósito para conferir se os valores foram substituidos,
# e ja vui que vou precisar fazer com os valores NaN tmb.BasePay

,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year
0,NaN,NaN,NaN,NaN,NaN,0,NaN,NaN,NaN
1,NaN,NaN,NaN,NaN,NaN,0,NaN,NaN,NaN
2,NaN,NaN,NaN,NaN,NaN,0,NaN,NaN,NaN
3,NaN,NaN,NaN,NaN,NaN,0,NaN,NaN,NaN
4,NaN,NaN,NaN,NaN,NaN,0,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...
312877,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
312878,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
312879,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
312880,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
312881,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [57]:
# Agora o replace com os valores NaN
df_1.fillna(0, inplace=True)

In [58]:
# Precisamos trabalhar a conversão das colunas BasePay, OvertimePay, OtherPay e Benefits
df_1['BasePay OvertimePay OtherPay Benefits'.split()] = pd.DataFrame(df_1['BasePay OvertimePay OtherPay Benefits'.split()], dtype=float)
df_1

,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year
0,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,0.0,567595.43,567595.43,2011
1,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,0.0,538909.28,538909.28,2011
2,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,0.0,335279.91,335279.91,2011
3,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,0.0,332343.61,332343.61,2011
4,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,0.0,326373.19,326373.19,2011
...,...,...,...,...,...,...,...,...,...
312877,Daniel W Plautz,Public Service Trainee,0.00,0.00,0.00,0.0,0.00,0.00,2018
312878,David J Thompson,Deputy Sheriff,0.00,0.00,0.00,0.0,0.00,0.00,2018
312879,Keiko Weng Yee Lau,Public Service Trainee,0.00,0.00,0.00,0.0,0.00,0.00,2018
312880,David Wong,Deputy Sheriff,0.00,0.00,0.00,0.0,0.00,0.00,2018
312881,Debora E Howard,Recreation Leader,0.00,0.00,0.00,0.0,0.00,0.00,2018

In [59]:
# Conferindo se os valores foram modificados
df_1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 312882 entries, 0 to 312881
Data columns (total 9 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   EmployeeName      312882 non-null  object
 1   JobTitle          312882 non-null  object
 2   BasePay           312882 non-null  float64
 3   OvertimePay       312882 non-null  float64
 4   OtherPay          312882 non-null  float64
 5   Benefits          312882 non-null  float64
 6   TotalPay          312882 non-null  float64
 7   TotalPayBenefits  312882 non-null  float64
 8   Year              312882 non-null  int64
dtypes: float64(6), int64(1), object(2)
memory usage: 21.5+ MB

In [65]:
# Médias
mean_base_pay = round(df_1.BasePay.mean(), 2)
mean_overtime_pay = round(df_1.OvertimePay.mean(), 2)
mean_benefits = round(df_1.Benefits.mean(), 2)
mean_other_pay = round(df_1.OtherPay.mean(), 2)
mean_total_pay = round(df_1.TotalPay.mean(), 2)
mean_total_pay_benefits = round(df_1.TotalPayBenefits.mean(), 2)

print('Média de Salario Base: ', mean_base_pay)
print('Média de Horas Extras: ', mean_overtime_pay)
print('Média de Benefícios: ', mean_benefits)
print('Média de Outros Pagamentos: ', mean_other_pay)
print('Média de Total Pagamentos: ', mean_total_pay)
print('Média de Total Pagamentos e Benefícios: ', mean_total_pay_benefits)

Média de Salario Base:  69673.05
Média de Horas Extras:  5668.91
Média de Benefícios:  22125.69
Média de Outros Pagamentos:  3460.68
Média de Total Pagamentos:  78802.65
Média de Total Pagamentos e Benefícios:  100928.34

In [102]:
# Quantidade de pessoas que tiveram o salario base, maior que a média total durante, viz por anos.
df__basepay_over_mean_by_year = df_1[df_1.BasePay > mean_base_pay].groupby('Year')['EmployeeName'].count()
df__basepay_over_mean_by_year = df__basepay_over_mean_by_year.to_frame(name='EmployeersOverMean')
df__basepay_over_mean_by_year['TotalEmployers_Year'] =  df_1.groupby('Year')['EmployeeName'].count()
df__basepay_over_mean_by_year['Repr(%)'] = round(df__basepay_over_mean_by_year['EmployeersOverMean'] / df__basepay_over_mean_by_year['TotalEmployers_Year'], 2)*100
df__basepay_over_mean_by_year
# df__basepay_over_mean_by_year.info()

      EmployeersOverMean  TotalEmployers_Year  Repr(%)
Year
2011               14932                36159     41.0
2012               15923                36766     43.0
2013               17291                37606     46.0
2014               16820                38119     44.0
2015               18130                39387     46.0
2016               20475                40970     50.0
2017               22310                41566     54.0
2018               23549                42309     56.0

In [108]:
# Quantidade gasta em Horas extas por ano.
df__spended_value_on_overtimepay = df_1.groupby('Year')['OvertimePay'].sum().to_frame('Total Spend Overtime Pays')
df__spended_value_on_overtimepay['Total Spend Overtime Pays'] = df__spended_value_on_overtimepay['Total Spend Overtime Pays'].apply(lambda v: str(v))

     Total Spend Overtime Pays
Year
2011              163838794.83
2012              184690979.73
2013              198621428.29
2014              205918599.27
2015              220840311.85
2016              251403088.33
2017              262937147.14
2018              285449947.93